<a href="https://colab.research.google.com/github/priyabants/Learning/blob/main/Python_Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

###1. Import python package

In [ ]:
#Import python package
import pandas as pd
import numpy as np

In [ ]:
#create a series in Pandas
x = pd.Series([1,2,3,4],index=['a','b','c','d'])
print(x)

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
#create a python dictionary with age and name of people
age_data = {
    'name':['Tom','Dick','Harry'],
    'age':[20,30,40]
}
print(age_data)

{'name': ['Tom', 'Dick', 'Harry'], 'age': [20, 30, 40]}

In [ ]:
#create a dataframe in pandas
df=pd.DataFrame(data=age_data, columns=["name","age"])
df

    name  age
0    Tom   20
1   Dick   30
2  Harry   40

In [ ]:
#Get data at 3rd row
print(df.iloc[2,:])

name    Harry
age        40
Name: 2, dtype: object

In [ ]:
#get the data at 1st column
print(df.iloc[:,0])

0      Tom
1     Dick
2    Harry
Name: name, dtype: object

In [ ]:
#get the 3rd row, 1st column
print(df.iloc[2,0])

Harry

In [ ]:
#add a new column in dataframe with same value in rows
df['gender']='Male'
df

    name  age gender
0    Tom   20   Male
1   Dick   30   Male
2  Harry   40   Male

In [ ]:
#Get the data of name column
df['name']

0      Tom
1     Dick
2    Harry
Name: name, dtype: object

In [ ]:
#get all the column name of dataframe
print(df.columns)

Index(['name', 'age', 'gender'], dtype='object')

In [ ]:
#import python package and create a data frame
import numpy as np
import pandas as pd
data = {
    'name': ['Tom','Dick','Harry','Rakul'],
    'score1': [100,20,40,30],
    'score2': [80,70,60,50]
}
df = pd.DataFrame(data=data, columns=['name','score1','score2'])
df

    name  score1  score2
0    Tom     100      80
1   Dick      20      70
2  Harry      40      60
3  Rakul      30      50

In [ ]:
#get the size of dataframe
print(df.shape)

(4, 3)

In [ ]:
#get no of rows and cols
print("#Rows:",df.shape[0])
print("#Cols:",df.shape[1])

#Rows: 4
#Cols: 3

In [ ]:
#Sort dataframe by one column
print(df.sort_values("score1"))

    name  score1  score2
1   Dick      20      70
3  Rakul      30      50
2  Harry      40      60
0    Tom     100      80

In [ ]:
#Sort by index
print(df.sort_index)

<bound method DataFrame.sort_index of     name  score1  score2
0    Tom     100      80
1   Dick      20      70
2  Harry      40      60
3  Rakul      30      50>

In [ ]:
#Get first row of dataframe
print(df[0:1])
#Get last row of dataframe
print(df[-1:])
#Get 2nd to 4th row of dataframe
print(df[1:4])

  name  score1  score2
0  Tom     100      80
    name  score1  score2
3  Rakul      30      50
    name  score1  score2
1   Dick      20      70
2  Harry      40      60
3  Rakul      30      50